--[[
按鍵說明
--]]


local function hotkeys(n)
  local s_1 = string.match( n, "^bo_mixin")
  local s_2 = string.match( n, "^bopomo_onionplus")
  local s_3 = string.match( n, "^bopomo_onion_double")
  local s_4 = string.match( n, "^onion[-]array30")
  local s_5 = string.match( n, "^ocm_")
  local s_6 = string.match( n, "^dif1")
  if s_1 or s_2 then
    k1_table = {
        { "🄋", "〖注音 mixin 和 plus 系列〗" }
      , { "➀", "　『 中 / 英 』" }
      , { "➁", "　　［shift］+［space］變換中英（未打字時）" }
      , { "➂", "　　［control］+［shift］+［  2  ］變換中英" }
      , { "➃", "　　［control］+［  ,  ］切換英文" }
      , { "➄", "　　［control］+［shift］+［  ,  ］切換中文" }
      , { "➅", "　『 打字輸入 』" }
      , { "➆", "　 • 上屏" }
      , { "➇", "　　［Enter］上屏中文（有選項時）" }
      , { "➈", "　　［space］上屏中文（末尾為聲調或選字時）" }
      , { "➀🄋", " • 特殊上屏" }
      , { "➀➀", "　［shift］+［Enter］上屏所對應的英文、數字、符號" }
      , { "➀➁", "　［control］+［Enter］上屏顯示編碼，如注音符號" }
      , { "➀➂", "　［control］+［shift］+［Enter］上屏選項注釋" }
      , { "➀➃", " • 刪除" }
      , { "➀➄", "　［esc］消除未上屏注音（清空）" }
      , { "➀➅", "　［BackSpace］刪除單個字全部注音" }
      , { "➀➆", "　［shift］+［BackSpace］刪除一個注音符號" }
      , { "➀➇", "　［  \\  ］刪除一個注音符號（選單出現時）" }
      , { "➀➈", " • 游標移位" }
      , { "➁🄋", "　［ right / left ］游標向左右一整個字（打字時）" }
      , { "➁➀", "　［shift］+［ right / left ］游標向左右一個注音" }
      , { "➁➁", "　［up］游標向左一個注音（打字時）" }
      , { "➁➂", "　［shift］+［tab］和［tab］上一節和下一節（首節）" }
      , { "➁➃", "　（↑ ［tab］切到首個字，一字一字選字時可善用）" }
      , { "➁➄", "　［tab］跳回游標切分狀態（選字時）" }
      , { "➁➅", " • 選字單翻頁" }
      , { "➁➆", "　［ right / left ］翻頁（選字時）" }
      , { "➁➇", "　［shift］+［ up / down ］翻頁（打字時）" }
      , { "➁➈", "　［shift］+［ C / space ］翻頁（打字時）" }
      , { "➂🄋", "　［shift］+［ I / K ］翻頁（打字時）" }
      , { "➂➀", " • 選字" }
      , { "➂➁", "　［shift］+［ QAZWSX ］選字（左邊）" }
      , { "➂➂", "　［shift］+［ YHNUJM ］選字（右邊）" }
      , { "➂➃", "　［control］+［ 123456 ］選字？！" }
      , { "➂➄", "　（↑ Mac 會鍵位衝突）" }
      , { "➂➅", "『 刪除自動記憶字詞 』" }
      , { "➂➆", "　［ shift / control ］+［BackSpace］ Win 刪記憶字詞" }
      , { "➂➇", "　［fn］+［shift］+［BackSpace］ Mac 刪記憶字詞" }
      , { "➂➈", "　［shift］+［Delete］ Mac 外接鍵盤沒 fn 鍵，刪記憶字詞" }
      , { "➃🄋", "　（↑ 該 Delete 非 BackSpace ）" }
      , { "➃➀", "　────────────  " }
      , { "➃➁", "　※ ［Enter］於 Mac 名稱為［return］" }
      , { "➃➂", "　※ ［BackSpace］於 Mac 名稱為［delete］" }
      }

    k2_table = {
        { "🄌", "〖注音 mixin 和 plus 系列〗" }
      , { "➊", "　『 方案選單 』" }
      , { "➋", "　　［control］+［  `  ］開啟方案選單（設置）" }
      , { "➌", "　　［control］+［shift］+［  `  ］開啟方案選單（設置）" }
      , { "➍", "　　［F4］開啟方案選單（設置）" }
      , { "➎", "　『 快捷鍵（上排/循環）』" }
      , { "➏", "　　［control］+［shift］+［  1  ］變換方案" }
      , { "➐", "　　［control］+［shift］+［  2  ］變換中英" }
      , { "➑", "　　［control］+［shift］+［  3  ］變換全半形" }
      , { "➒", "　　［control］+［shift］+［  4  ］變換標點全半形" }
      , { "➊🄌", "　［control］+［shift］+［  5  ］變換繁簡體" }
      , { "➊➊", "　［control］+［shift］+［  6  ］變換中文字符範圍" }
      , { "➊➋", "　［control］+［shift］+［  7  ］變換隨附 Emoji 有無" }
      , { "➊➌", "　［control］+［shift］+［  8  ］變換外語和符號注釋有無" }
      , { "➊➍", "　［control］+［shift］+［  9  ］變換 Unicode 編碼注釋有無" }
      , { "➊➎", "　［control］+［shift］+［  0  ］變換《Easy》英文排序" }
      , { "➊➏", "『 快捷鍵（下排/指定）』（初始設定 +［shift］）" }
      , { "➊➐", " • 切換設定" }
      , { "➊➑", "　［control］+［  ,  ］切換英文" }
      , { "➊➒", "　［control］+［  .  ］切換全形（全角）" }
      , { "➋🄌", "　［control］+［  /  ］切換標點半形" }
      , { "➋➊", "　［control］+［  ;  ］切換簡體轉換" }
      , { "➋➋", "　［control］+［  '  ］切換中文字符範圍為完整，不精簡" }
      , { "➋➌", "　［control］+［  [  ］切換隨附 Emoji 為無" }
      , { "➋➍", "　［control］+［  ]  ］切換外語和符號注釋為無" }
      , { "➋➎", "　（↑ 直按標點和「  =  」「符號」注釋無法關閉）" }
      , { "➋➏", "　［control］+［  -  ］切換 Unicode 編碼注釋為有" }
      , { "➋➐", "　［control］+［  =  ］切換《Easy》英文排序為序排" }
      , { "➋➑", "　（↑ 序排：按 a~z、個排(初始)：按字母個數 ）" }
      , { "➋➒", " • 初始設定" }
      , { "➌🄌", "　［control］+［shift］+［  ,  ］切換中文" }
      , { "➌➊", "　［control］+［shift］+［  .  ］切換半形（半角）" }
      , { "➌➋", "　［control］+［shift］+［  /  ］切換標點全形（原注音形式）" }
      , { "➌➌", "　［control］+［shift］+［  ;  ］切換不轉換簡體" }
      , { "➌➍", "　［control］+［shift］+［  '  ］切換中文其字符範圍為精簡" }
      , { "➌➎", "　［control］+［shift］+［  [  ］切換隨附 Emoji為有" }
      , { "➌➏", "　［control］+［shift］+［  ]  ］切換外語和符號注釋為有" }
      , { "➌➐", "　［control］+［shift］+［  -  ］切換 Unicode 編碼注釋為無" }
      , { "➌➑", "　［control］+［shift］+［  =  ］切換《Easy》英文排序為個排" }
      , { "➌➒", "　────────────  " }
      , { "➍🄌", "　※ 某些鍵位須用內附的 default.custom.yaml 檔" }
      , { "➍➊", "　※ ［control］+［  -  or  =  ］於 Win 易衝突，或關閉" }
      , { "➍➋", "　※ ［control］+［shift］+［  -  or  =  ］於 Win 易衝突，或關閉" }
      }
    -- , { "🄋", "　＊基本功能鍵" }
    -- , { "➀➇", "＊洋蔥版功能鍵" }
    -- , { "➁🄋", "　（洋蔥注音 plus 和 mixin 版限定，純注音版該鍵位為分節）" }
    -- , { "➃➂", "　（［ QAZWSX ］和［ YHNUJM ］在鍵盤上為同樣形狀區塊，只是左邊移到右邊。）" }
    -- , { "➃➃", "　（［ QAZWSX ］方便單手選字；［ YHNUJM ］方便雙手選字。）" }
    -- , { "➂➇", "　（須使用內附的 default.custom.yaml 檔）" }
    -- , { "➀➃", "　（↑ 使用內附的 default.custom.yaml 檔才有效）" }
    -- , { "➃➅", "　預設功能快捷鍵多在上排，增設下排手順較好位置。" }
    -- , { "➃➆", "　以下快捷鍵切換不循環，使所切換之項目能完全肯定，含［ shift ］為初始設定。" }
    -- , { "➃➇", "　欲循環切換可使用［ control ］ +［ shift ］+［ 1～9 ］" }
    -- , { "➃➈", "• 以下八個快捷鍵，須使用內附的 default.custom.yaml 檔：" }
    -- , { "➀🄋", "＊翻頁和選字" }
    -- , { "➃➅", "　（↑ Rime 官方預設為［4］）" }
    -- , { "➈", "　　（↑ 整個字的注音，非單一個注音符號）" }
    -- , { "➋➐", "　（↑ 例：æ 〔KK, DJ, IPA〕）" }
    -- , { "➋➏", "　（↑ 例：æ 〔KK, DJ, IPA〕）" }

  elseif s_3 then
    k1_table = {
        { "🄋", "〖注音雙拼〗" }
      , { "➀", "　『 中 / 英 』" }
      , { "➁", "　　［shift］+［space］變換中英（未打字時）" }
      , { "➂", "　　［control］+［shift］+［  2  ］變換中英" }
      , { "➃", "　　［control］+［  ,  ］切換英文" }
      , { "➄", "　　［control］+［shift］+［  ,  ］切換中文" }
      , { "➅", "　『 打字輸入 』" }
      , { "➆", "　 • 上屏" }
      , { "➇", "　　［space］上屏中文（有選項時）" }
      , { "➈", "　　［Enter］上屏中文（有選項時）" }
      , { "➀🄋", " • 特殊上屏" }
      , { "➀➀", "　［shift］+［Enter］上屏所對應的英文、數字、符號" }
      , { "➀➁", "　［control］+［Enter］上屏顯示編碼，如：ji/（ㄐㄧˊ）" }
      , { "➀➂", "　［control］+［shift］+［Enter］上屏選項注釋" }
      , { "➀➃", " • 刪除" }
      , { "➀➄", "　［esc］消除未上屏注音（清空）" }
      , { "➀➅", "　［space］消除未上屏輸入（清空）（空碼時）" }
      , { "➀➆", "　［BackSpace］刪除一個注音符號" }
      , { "➀➇", "　［shift］+［BackSpace］刪除單個字全部注音" }
      , { "➀➈", " • 分節" }
      , { "➁🄋", "　［  \\  ］分節（選單出現時）" }
      , { "➁➀", " • 游標移位" }
      , { "➁➁", "　［ right / left ］游標向左右一個注音" }
      , { "➁➂", "　［shift］+［ right / left ］游標向左右一整個字（打字時）" }
      , { "➁➃", "　［up］游標向左一整個字（打字時）" }
      , { "➁➄", "　［shift］+［tab］和［tab］上一節和下一節（首節）" }
      , { "➁➅", "　（↑ ［tab］切到首個字，一字一字選字時可善用）" }
      , { "➁➆", "　［tab］跳回游標切分狀態（選字時）" }
      , { "➁➇", " • 選字單翻頁" }
      , { "➁➈", "　［ right / left ］翻頁（選字時）" }
      , { "➂🄋", "　［shift］+［ up / down ］翻頁（打字時）" }
      , { "➂➀", "　［shift］+［ tab / space ］翻頁（選字/打字時）" }
      , { "➂➁", " • 選字" }
      , { "➂➂", "　［ 123456 ］選字" }
      , { "➂➃", "　［control］+［ 123456 ］選字？！" }
      , { "➂➄", "　（↑ Mac 會鍵位衝突）" }
      , { "➂➅", "『 刪除自動記憶字詞 』" }
      , { "➂➆", "　［ shift / control ］+［BackSpace］ Win 刪記憶字詞" }
      , { "➂➇", "　［fn］+［shift］+［BackSpace］ Mac 刪記憶字詞" }
      , { "➂➈", "　［shift］+［Delete］ Mac 外接鍵盤沒 fn 鍵，刪記憶字詞" }
      , { "➃🄋", "　（↑ 該 Delete 非 BackSpace ）" }
      , { "➃➀", "　────────────  " }
      , { "➃➁", "　※ ［Enter］於 Mac 名稱為［return］" }
      , { "➃➂", "　※ ［BackSpace］於 Mac 名稱為［delete］" }
      }

    k2_table = {
        { "🄌", "〖注音雙拼〗" }
      , { "➊", "　『 方案選單 』" }
      , { "➋", "　　［control］+［  `  ］開啟方案選單（設置）" }
      , { "➌", "　　［control］+［shift］+［  `  ］開啟方案選單（設置）" }
      , { "➍", "　　［F4］開啟方案選單（設置）" }
      , { "➎", "　『 快捷鍵（上排/循環）』" }
      , { "➏", "　　［control］+［shift］+［  1  ］變換方案" }
      , { "➐", "　　［control］+［shift］+［  2  ］變換中英" }
      , { "➑", "　　［control］+［shift］+［  3  ］變換全半形" }
      , { "➒", "　　［control］+［shift］+［  4  ］變換標點全半形" }
      , { "➊🄌", "　［control］+［shift］+［  5  ］變換繁簡體" }
      , { "➊➊", "　［control］+［shift］+［  6  ］變換中文字符範圍（CJK）" }
      , { "➊➋", "　［control］+［shift］+［  7  ］變換隨附 Emoji 有無" }
      , { "➊➌", "　［control］+［shift］+［  8  ］變換 Unicode 編碼注釋有無" }
      , { "➊➍", "　［control］+［shift］+［  9  ］變換 Enter 上屏中文或原始輸入" }
      , { "➊➎", "『 快捷鍵（下排/指定）』（初始設定 +［shift］）" }
      , { "➊➏", " • 切換設定" }
      , { "➊➐", "　［control］+［  ,  ］切換英文" }
      , { "➊➑", "　［control］+［  .  ］切換全形（全角）" }
      , { "➊➒", "　［control］+［  /  ］切換標點半形" }
      , { "➋🄌", "　［control］+［  ;  ］切換簡體轉換" }
      , { "➋➊", "　［control］+［  '  ］切換中文字符範圍為完整，不精簡" }
      , { "➋➋", "　［control］+［  [  ］切換隨附 Emoji 為無" }
      , { "➋➌", "　［control］+［  -  ］切換 Unicode 編碼注釋為有" }
      , { "➋➍", "　［control］+［  =  ］切換 Enter 上屏原始輸入" }
      , { "➋➎", " • 初始設定" }
      , { "➋➏", "　［control］+［shift］+［  ,  ］切換中文" }
      , { "➋➐", "　［control］+［shift］+［  .  ］切換半形（半角）" }
      , { "➋➑", "　［control］+［shift］+［  /  ］切換標點全形" }
      , { "➋➒", "　［control］+［shift］+［  ;  ］切換不轉換簡體" }
      , { "➌🄌", "　［control］+［shift］+［  '  ］切換中文其字符範圍為精簡（CJK）" }
      , { "➌➊", "　［control］+［shift］+［  [  ］切換隨附 Emoji為有" }
      , { "➌➋", "　［control］+［shift］+［  -  ］切換 Unicode 編碼注釋為無" }
      , { "➌➌", "　［control］+［shift］+［  =  ］切換 Enter 上屏中文" }
      , { "➌➍", "　────────────  " }
      , { "➌➎", "　※ 某些鍵位須用內附的 default.custom.yaml 檔" }
      , { "➌➏", "　※ ［control］+［  -  or  =  ］於 Win 易衝突，或關閉" }
      , { "➌➐", "　※ ［control］+［shift］+［  -  or  =  ］於 Win 易衝突，或關閉" }
      }

  elseif s_4 then
    k1_table = {
        { "🄋", "〖行列３０〗" }
      , { "➀", "　『 中 / 英 』" }
      , { "➁", "　　［shift］+［space］變換中英（未打字時）" }
      , { "➂", "　　［control］+［shift］+［  2  ］變換中英" }
      , { "➃", "　　［control］+［  ,  ］切換英文" }
      , { "➄", "　　［control］+［shift］+［  ,  ］切換中文" }
      , { "➅", "　『 打字輸入 』" }
      , { "➆", "　 • 上屏" }
      , { "➇", "　　［Enter］上屏中文（有選項時）（翻頁模式）" }
      , { "➈", "　　［space］上屏中文（不輸出空白且有選項只一頁時）（翻頁模式）" }
      , { "➀🄋", "　［space］上屏中文（不輸出空白且有選項時）（上屏模式）" }
      -- , { "➀🄋", "　［space］上屏中文（不輸出空白且有選項時）（確認模式）" }
      , { "➀➀", "　 • 特殊上屏" }
      , { "➀➁", "　［Enter］上屏所對應的英文、數字、符號（上屏模式）" }
      , { "➀➂", "　［shift］+［Enter］上屏所對應的英文、數字、符號" }
      , { "➀➃", "　［control］+［Enter］上屏顯示編碼，如：7⇣4-9-" }
      , { "➀➄", "　［control］+［shift］+［Enter］上屏選項注釋" }
      , { "➀➅", " • 刪除" }
      , { "➀➆", "　［esc］消除未上屏輸入（清空）" }
      , { "➀➇", "　［space］消除未上屏輸入（清空）（空碼時）" }
      , { "➀➈", "　［Enter］消除未上屏輸入（清空）（空碼時）（翻頁模式）" }
      , { "➁🄋", "　［BackSpace］刪除一個輸入碼" }
      , { "➁➀", " • 選字單翻頁" }
      , { "➁➁", "　［ right / left ］翻頁（選字時）" }
      , { "➁➂", "　［shift］+［ up / down ］翻頁（打字時）" }
      , { "➁➃", "　［shift］+［ tab / space ］翻頁（打字時）" }
      , { "➁➄", "　［tab］空白鍵回復可輸入空白（翻頁時）" }
      , { "➁➅", "　［space］翻頁（不輸出空白且可翻時）（翻頁模式）" }
      , { "➁➆", " • 選字" }
      , { "➁➇", "　［ 1234567890 ］選字" }
      , { "➁➈", "　［control］+［ 1234567890 ］選字？！" }
      , { "➂🄋", "　（↑ Mac 會鍵位衝突）" }
      , { "➂➀", "　────────────  " }
      , { "➂➁", "　※ ［Enter］於 Mac 名稱為［return］" }
      , { "➂➂", "　※ ［BackSpace］於 Mac 名稱為［delete］" }
      }

    k2_table = {
        { "🄌", "〖行列３０〗" }
      , { "➊", "　『 方案選單 』" }
      , { "➋", "　　［control］+［  `  ］開啟方案選單（設置）" }
      , { "➌", "　　［control］+［shift］+［  `  ］開啟方案選單（設置）" }
      , { "➍", "　　［F4］開啟方案選單（設置）" }
      , { "➎", "　『 快捷鍵（上排/循環）』" }
      , { "➏", "　　［control］+［shift］+［  1  ］變換方案" }
      , { "➐", "　　［control］+［shift］+［  2  ］變換中英" }
      , { "➑", "　　［control］+［shift］+［  3  ］變換全半形" }
      , { "➒", "　　［control］+［shift］+［  4  ］變換標點全半形" }
      , { "➊🄌", "　［control］+［shift］+［  5  ］變換繁簡體" }
      , { "➊➊", "　［control］+［shift］+［  6  ］變換中文字符範圍" }
      , { "➊➋", "　［control］+［shift］+［  7  ］變換編碼標注有無" }
      , { "➊➌", "　［control］+［shift］+［  8  ］變換［space］為上屏或翻頁" }
      , { "➊➍", "　［control］+［shift］+［  9  ］變換預測詞開關" }
      , { "➊➎", "『 快捷鍵（下排/指定）』（初始設定 +［shift］）" }
      , { "➊➏", " • 切換設定" }
      , { "➊➐", "　［control］+［  ,  ］切換英文" }
      , { "➊➑", "　［control］+［  .  ］切換全形（全角）" }
      , { "➊➒", "　［control］+［  /  ］切換標點半形" }
      , { "➋🄌", "　［control］+［  ;  ］切換簡體轉換" }
      , { "➋➊", "　［control］+［  '  ］切換中文字符範圍為完整（增廣），不精簡" }
      , { "➋➋", "　［control］+［  [  ］切換編碼標注為無" }
      , { "➋➌", "　［control］+［  ]  ］切換［space］為上屏模式" }
      , { "➋➍", "　［control］+［  -  ］切換預測詞為開" }
      , { "➋➎", " • 初始設定" }
      , { "➋➏", "　［control］+［shift］+［  ,  ］切換中文" }
      , { "➋➐", "　［control］+［shift］+［  .  ］切換半形（半角）" }
      , { "➋➑", "　［control］+［shift］+［  /  ］切換標點全形" }
      , { "➋➒", "　［control］+［shift］+［  ;  ］切換不轉換簡體" }
      , { "➌🄌", "　［control］+［shift］+［  '  ］切換中文其字符範圍為精簡（CJK）" }
      , { "➌➊", "　［control］+［shift］+［  [  ］切換編碼標注為有" }
      , { "➌➋", "　［control］+［shift］+［  ]  ］切換［space］為翻頁模式" }
      , { "➌➌", "　［control］+［shift］+［  -  ］切換預測詞為關" }
      , { "➌➍", "　────────────  " }
      , { "➌➎", "　※ 某些鍵位須用內附的 default.custom.yaml 檔" }
      , { "➌➏", "　※ ［control］+［  -  ］於 Win 易衝突，或關閉" }
      , { "➌➐", "　※ ［control］+［shift］+［  -  ］於 Win 易衝突，或關閉" }
      }

    -- k2_straight_up_table = {
    --     { "🄌", "〖行列３０〗" }
    --   , { "➊", "　『 方案選單 』" }
    --   , { "➋", "　　［control］+［  `  ］開啟方案選單（設置）" }
    --   , { "➌", "　　［control］+［shift］+［  `  ］開啟方案選單（設置）" }
    --   , { "➍", "　　［F4］開啟方案選單（設置）" }
    --   , { "➎", "　『 快捷鍵（上排/循環）』" }
    --   , { "➏", "　　［control］+［shift］+［  1  ］變換方案" }
    --   , { "➐", "　　［control］+［shift］+［  2  ］變換中英" }
    --   , { "➑", "　　［control］+［shift］+［  3  ］變換全半形" }
    --   , { "➒", "　　［control］+［shift］+［  4  ］變換標點全半形" }
    --   , { "➊🄌", "　［control］+［shift］+［  5  ］變換繁簡體" }
    --   , { "➊➊", "　［control］+［shift］+［  6  ］變換中文字符範圍" }
    --   , { "➊➋", "　［control］+［shift］+［  7  ］變換編碼標注有無" }
    --   , { "➊➌", "　［control］+［shift］+［  8  ］變換上屏簡碼(多個)為直上或香草" }
    --   , { "➊➍", "　［control］+［shift］+［  9  ］變換［space］為上屏或翻頁" }
    --   , { "➊➎", "　（↑ Win 會鍵位衝突）" }
    --   , { "➊➏", "『 快捷鍵（下排/指定）』（初始設定 +［shift］）" }
    --   , { "➊➐", " • 切換設定" }
    --   , { "➊➑", "　［control］+［  ,  ］切換英文" }
    --   , { "➊➒", "　［control］+［  .  ］切換全形（全角）" }
    --   , { "➋🄌", "　［control］+［  /  ］切換標點半形" }
    --   , { "➋➊", "　［control］+［  ;  ］切換簡體轉換" }
    --   , { "➋➋", "　［control］+［  '  ］切換中文字符範圍為完整（增廣），不精簡" }
    --   , { "➋➌", "　［control］+［  [  ］切換編碼標注為無" }
    --   , { "➋➍", "　［control］+［  ]  ］切換上屏簡碼(多個)為直上" }
    --   , { "➋➎", "　［control］+［  -  ］切換［space］為上屏模式" }
    --   , { "➋➏", " • 初始設定" }
    --   , { "➋➐", "　［control］+［shift］+［  ,  ］切換中文" }
    --   , { "➋➑", "　［control］+［shift］+［  .  ］切換半形（半角）" }
    --   , { "➋➒", "　［control］+［shift］+［  /  ］切換標點全形" }
    --   , { "➌🄌", "　［control］+［shift］+［  ;  ］切換不轉換簡體" }
    --   , { "➌➊", "　［control］+［shift］+［  '  ］切換中文其字符範圍為精簡（CJK）" }
    --   , { "➌➋", "　［control］+［shift］+［  [  ］切換編碼標注為有" }
    --   , { "➌➌", "　［control］+［shift］+［  ]  ］切換上屏簡碼(多個)為香草模式" }
    --   , { "➌➍", "　［control］+［shift］+［  -  ］切換［space］為翻頁模式" }
    --   , { "➌➎", "　────────────  " }
    --   , { "➌➏", "　※ 某些鍵位須用內附的 default.custom.yaml 檔" }
    --   , { "➌➐", "　※ ［control］+［  -  ］於 Win 易衝突，或關閉" }
    --   , { "➌➑", "　※ ［control］+［shift］+［  -  ］於 Win 易衝突，或關閉" }
    --   }
    --   -- , { "➊➍", "　［control］+［shift］+［  9  ］變換 w 符號 space 為上屏或翻頁" }
    --   -- , { "➊➎", "　［control］+［shift］+［  0  ］變換 Enter 上屏中文或原始輸入" }
    --   -- , { "➋➏", "　［control］+［  -  ］切換 w 符號 space 為翻頁" }
    --   -- , { "➋➐", "　［control］+［  =  ］切換 Enter 上屏中文" }
    --   -- , { "➌➏", "　［control］+［shift］+［  -  ］切換 w 符號 space 為上屏" }
    --   -- , { "➌➐", "　［control］+［shift］+［  =  ］切換 Enter 上屏原始輸入" }
    --   -- , { "➀➀", "　［shift］+［BackSpace］刪除一個輸入碼" }
    --   -- , { "➀➅", " • 游標移位" }
    --   -- , { "➀➆", "　［right / left］游標向左右一個編碼" }
    --   -- , { "➀➇", "　［shift］+［right / left］游標向左右一整個字（打字時）" }
    --   -- , { "➅➅", "　（↑ 不上屏中文，則上屏原始輸入碼）" }
    --   -- , { "➌➐", "　※ ［control］+［  -  or  =  ］於 Win 易衝突，或關閉" }
    --   -- , { "➌➑", "　※ ［control］+［shift］+［  -  or  =  ］於 Win 易衝突，或關閉" }

  elseif s_5 or s_6 then
    k1_table = {
        { "🄋", "〖形碼方案〗" }
      , { "➀", "　『 中 / 英 』" }
      , { "➁", "　　［shift］+［space］變換中英（未打字時）" }
      , { "➂", "　　［control］+［shift］+［  2  ］變換中英" }
      , { "➃", "　　［control］+［  ,  ］切換英文" }
      , { "➄", "　　［control］+［shift］+［  ,  ］切換中文" }
      , { "➅", "　『 打字輸入 』" }
      , { "➆", "　 • 上屏" }
      , { "➇", "　　［space］上屏中文（有選項時）" }
      , { "➈", "　　［Enter］上屏中文（有選項時）" }
      , { "➀🄋", " • 特殊上屏" }
      , { "➀➀", "　［shift］+［Enter］上屏所對應的英文、數字、符號" }
      , { "➀➁", "　［control］+［Enter］上屏顯示編碼，如：DJ" }
      , { "➀➂", "　［control］+［shift］+［Enter］上屏選項注釋" }
      , { "➀➃", " • 刪除" }
      , { "➀➄", "　［esc］消除未上屏注音（清空）" }
      , { "➀➅", "　［BackSpace］刪除一個注音符號" }
      , { "➀➆", "　［shift］+［BackSpace］刪除單個字全部注音" }
      , { "➀➇", " • 分節" }
      , { "➀➈", "　［  |  ］分節（選單出現時）" }
      , { "➁🄋", " • 游標移位" }
      , { "➁➀", "　［ right / left ］游標向左右一個編碼（打字時）" }
      , { "➁➁", "　［shift］+［ right / left ］游標向左右一整個字" }
      , { "➁➂", "　［up］游標向左一整個字（打字時）" }
      , { "➁➃", "　［shift］+［tab］和［tab］上一節和下一節（首節）" }
      , { "➁➄", "　（↑ ［tab］切到首個字，一字一字選字時可善用）" }
      , { "➁➅", "　［tab］跳回游標切分狀態（選字時）" }
      , { "➁➆", " • 選字單翻頁" }
      , { "➁➇", "　［ right / left ］翻頁（選字時）" }
      , { "➁➈", "　［shift］+［ up / down ］翻頁（打字時）" }
      , { "➂🄋", "　［shift］+［ C / space ］翻頁（打字時）" }
      , { "➂➀", " • 選字" }
      , { "➂➁", "　［ 012345678 ］選字" }
      , { "➂➂", "　［control］+［ 012345678 ］選字？！" }
      , { "➂➃", "　（↑ Mac 會鍵位衝突）" }
      , { "➂➄", "" }
      , { "➂➅", "『 刪除自動記憶字詞 』" }
      , { "➂➆", "　［ shift / control ］+［BackSpace］ Win 刪記憶字詞" }
      , { "➂➇", "　［fn］+［shift］+［BackSpace］ Mac 刪記憶字詞" }
      , { "➂➈", "　［shift］+［Delete］ Mac 外接鍵盤沒 fn 鍵，刪記憶字詞" }
      , { "➃🄋", "　（↑ 該 Delete 非 BackSpace ）" }
      , { "➃➀", "　────────────  " }
      , { "➃➁", "　※ ［Enter］於 Mac 名稱為［return］" }
      , { "➃➂", "　※ ［BackSpace］於 Mac 名稱為［delete］" }
      }

    k2_table = {
        { "🄌", "〖形碼方案〗" }
      , { "➊", "　『 方案選單 』" }
      , { "➋", "　　［control］+［  `  ］開啟方案選單（設置）" }
      , { "➌", "　　［control］+［shift］+［  `  ］開啟方案選單（設置）" }
      , { "➍", "　　［F4］開啟方案選單（設置）" }
      , { "➎", "　『 快捷鍵（上排/循環）』" }
      , { "➏", "　　［control］+［shift］+［  1  ］變換方案" }
      , { "➐", "　　［control］+［shift］+［  2  ］變換中英" }
      , { "➑", "　　［control］+［shift］+［  3  ］變換全半形" }
      , { "➒", "　　［control］+［shift］+［  4  ］變換標點全半形" }
      , { "➊🄌", "　［control］+［shift］+［  5  ］變換繁簡體" }
      , { "➊➊", "　［control］+［shift］+［  6  ］變換中文字符範圍" }
      , { "➊➋", "　［control］+［shift］+［  7  ］變換隨附 Emoji 有無" }
      , { "➊➌", "　［control］+［shift］+［  8  ］變換編碼標注有無" }
      , { "➊➍", "　［control］+［shift］+［  9  ］變換外語和符號注釋有無" }
      , { "➊➎", "　［control］+［shift］+［  0  ］變換 Unicode 編碼注釋有無" }
      -- , { "➊➎", "　［control］+［shift］+［  0  ］變換《Easy》英文排序？！" }
      , { "➊➏", "　（↑ Win 會鍵位衝突）" }
      , { "➊➐", "" }
      , { "➊➑", "『 快捷鍵（下排/指定）』（初始設定 +［shift］）" }
      , { "➊➒", " • 切換設定" }
      , { "➋🄌", "　［control］+［  ,  ］切換英文" }
      , { "➋➊", "　［control］+［  .  ］切換全形（全角）" }
      , { "➋➋", "　［control］+［  /  ］切換標點半形" }
      , { "➋➌", "　［control］+［  ;  ］切換簡體轉換" }
      , { "➋➍", "　［control］+［  '  ］切換中文字符範圍為完整，不精簡" }
      , { "➋➎", "　［control］+［  [  ］切換編碼標注為無" }
      , { "➋➏", "　［control］+［  ]  ］切換外語和符號注釋為無" }
      , { "➋➐", "　（↑ 直按標點和「 = 」「符號」注釋無法關閉）" }
      , { "➋➑", "　［control］+［  -  ］切換 Unicode 編碼注釋為有" }
      , { "➋➒", "　［control］+［  =  ］切換《Easy》英文排序為序排" }
      , { "➌🄌", "　（↑ 序排：按 a~z、個排(初始)：按字母個數 ）" }
      , { "➌➊", " • 初始設定" }
      , { "➌➋", "　［control］+［shift］+［  ,  ］切換中文" }
      , { "➌➌", "　［control］+［shift］+［  .  ］切換半形（半角）" }
      , { "➌➍", "　［control］+［shift］+［  /  ］切換標點全形" }
      , { "➌➎", "　［control］+［shift］+［  ;  ］切換不轉換簡體" }
      , { "➌➏", "　［control］+［shift］+［  '  ］切換中文其字符範圍為精簡" }
      , { "➌➐", "　［control］+［shift］+［  [  ］切換編碼標注為有" }
      , { "➌➑", "　［control］+［shift］+［  ]  ］切換外語和符號注釋為有" }
      , { "➌➒", "　［control］+［shift］+［  -  ］切換 Unicode 編碼注釋為無" }
      , { "➍🄌", "　［control］+［shift］+［  =  ］切換《Easy》英文排序為個排" }
      , { "➍➊", "　────────────  " }
      , { "➍➋", "　※ 某些鍵位須用內附的 default.custom.yaml 檔" }
      , { "➍➌", "　※ ［control］+［  -  or  =  ］於 Win 易衝突，或關閉" }
      , { "➍➍", "　※ ［control］+［shift］+［  -  or  =  ］於 Win 易衝突，或關閉" }
      }

  else
    k1_table = {
        { "🄋", "〖不明方案〗" }
      -- , { "➀", "　待補" }
      }

    k2_table = {
        { "🄌", "〖不明方案〗" }
      -- , { "➊", "　待補" }
      }

  end
  return {k1_table, k2_table}
end

return hotkeys