--[[
各種語言編碼鍵位說明
--]]


local kc_table = {
    { "ⅰ", "　『 基礎俄文字母 』" }
  , { "ⅱ", "　　А|а(a)　В|в(b)　С|с(c)　Д|д(d)　Е|е(e)　Ф|ф(f)　" }
  , { "ⅲ", "　　Г|г(g)　Н|н(h)　Ю|ю(i/iho)　Ж|ж(j)　К|к(k)　" }
  , { "ⅳ", "　　Л|л(l/jhi)　М|м(m)　И|и(n)　О|о(o)　Р|р(p)　" }
  , { "ⅴ", "　　Э|э(q)　П|п(r)　Б|б(s)　Т|т(t)　Ч|ч(u)　Ц|ц(v)　" }
  , { "ⅵ", "　　Ш|ш(w)　Х|х(x)　У|у(y)　З|з(z)　" }
  , { "ⅶ", "　　Ь|ь(bf*)　Ы|ы(bi*/bhi)　Ъ|ъ(br)　" }
  , { "ⅷ", "　　Ё|ё(eb)　Й|й(nu)　Я|я(rk)　Щ|щ(wy)　" }
  , { "ⅸ", "　『 早期俄文字母 』" }
  , { "ⅹ", "　　Ѣ|ѣ(bt)　І|і(ii)　Ѵ|ѵ(vr)　Ѳ|ѳ(qi)　" }
  , { "ⅺ", "　　Ѫ|ѫ(vf)　Ѭ|ѭ(ivf/ihvf)　Ѧ|ѧ(af)　Ѩ|ѩ(iaf/ihaf)　" }
  , { "ⅻ", "　『 早期西里爾字母 』" }
  , { "ⅹⅲ", "　Ѕ|ѕ(si)　Ꙁ|ꙁ(zj)　Ѹ|ѹ(ohy)　Ѡ|ѡ(wi)　" }
  , { "ⅹⅳ", "　Ꙑ|ꙑ(bri/brhi)　Ꙗ|ꙗ(iha)　Ѥ|ѥ(iqk/ihc/ihqk)　" }
  , { "ⅹⅴ", "　Ѯ|ѯ(zfy/zfv/zcy/zcv/zyc/zvc)　Ѱ|ѱ(ui)　" }
  , { "ⅹⅵ", "　Ҁ|ҁ(cfy/cy/cfk)　" }
  , { "ⅹⅶ", "　Ї|ї(ib)　Ѻ|ѻ(of)　Ѿ|ѿ(wt)　" }
  -- , { "ⅹⅷ", "────────────  " }
  -- , { "ⅼ", "" }
  -- , { "ⅽ", "" }
  -- , { "ⅾ", "" }
  -- , { "ⅿ", "" }
  -- , { "ↄ", "" }
  }


return kc_table