--[[
各種語言編碼鍵位說明
--]]


local kg_table = {
    { "Ⅰ", "　『 基礎希臘字母 』" }
  , { "Ⅱ", "　　Α|α(a)　Β|β(b)　ς(c*)　Δ|δ(d)　Ε|ε(e)　Φ|φ(f)　" }
  , { "Ⅲ", "　　Γ|γ(g)　Η|η(h)　Ι|ι(i)　Ξ|ξ(j)　Κ|κ(k)　Λ|λ(l)　" }
  , { "Ⅳ", "　　Μ|μ(m)　Ν|ν(n)　Ο|ο(o)　Ρ|ρ(p)　Θ|θ(q)　" }
  , { "Ⅴ", "　　Π|π(r)　Σ|σ(s)　Τ|τ(t)　Ψ|ψ(u)　ν(v*)　Ω|ω(w)　" }
  , { "Ⅵ", "　　Χ|χ(x)　Υ|υ(y)　Ζ|ζ(z)　" }
  , { "Ⅶ", "　『 已停用希臘字母 』" }
  , { "Ⅷ", "　　Ϝ|ϝ(fi)　Ͷ|ͷ(ni)　Ϛ|ϛ(ci)　Ͳ|ͳ(ti)　Ͱ|ͱ(ih)　" }
  , { "Ⅸ", "　　Ϻ|ϻ(mi/mf/myc/my)　Ϙ|ϙ(oy)　Ϟ|ϟ(kf/kw)　" }
  , { "Ⅹ", "　　Ϡ|ϡ(zf)　" }
  , { "Ⅺ", "　『 補充希臘字母 』" }
  , { "Ⅻ", "　　Ϳ|ϳ(ji)　Ϸϸ(lf/bhp/iho/lho)　" }
  -- , { "Ⅻ", "────────────  " }
  -- , { "Ⅼ", "" }
  -- , { "Ⅽ", "" }
  -- , { "Ⅾ", "" }
  -- , { "Ⅿ", "" }
  -- , { "Ↄ", "" }
  }


return kg_table