--[[
各種語言編碼鍵位說明
--]]


local kh_table = {
    { "🄀", "『 單子音 』" }
  , { "⒈", "　ㄱ(g)　ㄷ(d)     　ㅂ(b)    　ㅅ(s)　ㅇ(x/ng)　" }
  , { "⒉", "　ㅋ(k)　ㅌ(t)      　ㅍ(p/f) 　ㅈ(j) 　ㅎ(h)　" }
  , { "⒊", "　ㄴ(n)　ㄹ(l/r)   　ㅁ(m)   　ㅊ(c)　" }
  , { "⒋", "『 雙子音 』" }
  , { "⒌", "　ㄲ(gg)　ㄸ(dd)　ㅃ(bb)　ㅆ(ss)　ㅉ(jj)　" }
  , { "⒍", "『 單母音 』" }
  , { "⒎", "　ㅣ(i)  　ㅏ(a) 　ㅑ(ya)　" }
  , { "⒏", "　ㅡ(w)　ㅜ(u) 　ㅠ(yu)　" }
  , { "⒐", "　　      　ㅓ(e) 　ㅕ(ye)　" }
  , { "⒑", "　　      　ㅗ(o) 　ㅛ(yo)　" }
  , { "⒒", "『 雙母音 』" }
  , { "⒓", "　ㅐ(ai)　ㅒ(yai)　ㅘ(oa) 　ㅝ(ue)　" }
  , { "⒔", "　ㅔ(ei)　ㅖ(yei)　ㅙ(oai)　ㅞ(uei)　" }
  , { "⒕", "　　    　　          　ㅚ(oi)   　ㅟ(ui)　ㅢ(wi)　" }
  , { "⒖", "────────────  " }
  , { "⒗", "※  i ↔ y 可互換　" }
  , { "⒘", "────────────  " }
  , { "⒙", "" }
  , { "⒚", "" }
  , { "⒛", "" }
  }


return kh_table