--[[
各種語言編碼鍵位說明
--]]


local kj_table = {
    { "　『 五十音 』", "０" }
  , { "　　あ|ア(a)　い|イ(i)　う|ウ(u)　え|エ(e)　お|オ(o)　", "１" }
  , { "　　か|カ(ka)　き|キ(ki)　く|ク(ku)　け|ケ(ke)　こ|コ(ko)　", "２" }
  , { "　　さ|サ(sa)　し|シ(shi/si)　す|ス(su)　せ|セ(se)　そ|ソ(so)　", "３" }
  , { "　　た|タ(ta)　ち|チ(chi/ti)　つ|ツ(tsu/tu)　て|テ(te)　と|ト(to)　", "４" }
  , { "　　な|ナ(na)　に|ニ(ni)　ぬ|ヌ(nu)　ね|ネ(ne)　の|ノ(no)　", "５" }
  , { "　　は|ハ(ha)　ひ|ヒ(hi)　ふ|フ(fu/hu)　へ|ヘ(he)　ほ|ホ(ho)　", "６" }
  , { "　　ま|マ(ma)　み|ミ(mi)　む|ム(mu)　め|メ(me)　も|モ(mo)　", "７" }
  , { "　　や|ヤ(ya)　ゆ|ユ(yu)　よ|ヨ(yo)　", "８" }
  , { "　　ら|ラ(ra)　り|リ(ri)　る|ル(ru)　れ|レ(re)　ろ|ロ(ro)　", "９" }
  , { "　わ|ワ(wa)　を|ヲ(wo)　ん|ン(n)", "１０" }
  , { "　ゐ|ヰ(wi/i/wyi)　ゑ|ヱ(we/e/wye)　", "１１" }
  , { "『 濁音和半濁音 』", "１２" }
  , { "　が|ガ(ga)　ぎ|ギ(gi)　ぐ|グ(gu)　げ|ゲ(ge)　ご|ゴ(go)　", "１３" }
  , { "　ざ|ザ(za)　じ|ジ(ji/zi)　ず|ズ(zu)　ぜ|ゼ(ze)　ぞ|ゾ(zo)　", "１４" }
  , { "　だ|ダ(da)　ぢ|ヂ(di)　づ|ヅ(du)　で|デ(de)　ど|ド(do)　", "１５" }
  , { "　ば|バ(ba)　び|ビ(bi)　ぶ|ブ(bu)　べ|ベ(be)　ぼ|ボ(bo)　", "１６" }
  , { "　ぱ|パ(pa)　ぴ|ピ(pi)　ぷ|プ(pu)　ぺ|ペ(pe)　ぽ|ポ(po)　", "１７" }
  , { "　ヷ(va)　ヸ(vi)　ゔ|ヴ(vu)　ヹ(ve)　ヺ(vo)　", "１８" }
  , { "『 小寫 』", "１９" }
  , { "　ぁ|ァ(xa)　ぃ|ィ(xi)　ぅ|ゥ(xu)　ぇ|ェ(xe)　ぉ|ォ(xo)　", "２０" }
  , { "　っ|ッ(xtu/xtsu)　ゎ|ヮ(xwa)　", "２１" }
  , { "　ゃ|ャ(xya)　ゅ|ュ(xyu)　ょ|ョ(xyo)　", "２２" }
  , { "　ゕ|ヵ(xka/(ヵ=ka))　ゖ|ヶ(xke/(ヶ=ke/ga))　", "２３" }
  , { "『 拗音 』", "２４" }
  , { "　きゃ|キャ(kya)　きゅ|キュ(kyu)　きょ|キョ(kyo)　", "２５" }
  , { "　ぎゃ|ギャ(gya)　ぎゅ|ギュ(gyu)　ぎょ|ギョ(gyo)　", "２６" }
  , { "　しゃ|シャ(sha/sya)　しゅ|シュ(shu/syu)　しょ|ショ(sho/syo)　", "２７" }
  , { "　じゃ|ジャ(ja/jya/zya)　じゅ|ジュ(ju/jyu/zyu)　じょ|ジョ(jo/jyo/zyo)　", "２８" }
  , { "　ぢゃ|ヂャ(dya/ja/zya)　ぢゅ|ヂュ(dyu/ju/zyu)　ぢょ|ヂョ(dyo/jo/zyo)　", "２９" }
  , { "　ちゃ|チャ(cha/tya/cya)　ちゅ|チュ(chu/tyu/cyu)　ちょ|チョ(cho/tyo/cyo)　", "３０" }
  , { "　にゃ|ニャ(nya)　にゅ|ニュ(nyu)　にょ|ニョ(nyo)　", "３１" }
  , { "　ひゃ|ヒャ(hya)　ひゅ|ヒュ(hyu)　ひょ|ヒョ(hyo)　", "３２" }
  , { "　びゃ|ビャ(bya)　びゅ|ビュ(byu)　びょ|ビョ(byo)　", "３３" }
  , { "　ぴゃ|ピャ(pya)　ぴゅ|ピュ(pyu)　ぴょ|ピョ(pyo)　", "３４" }
  , { "　みゃ|ミャ(mya)　みゅ|ミュ(myu)　みょ|ミョ(myo)　", "３５" }
  , { "　りゃ|リャ(rya)　りゅ|リュ(ryu)　リョ|りょ(ryo)　", "３６" }
  , { "════════════  ", "３７" }
  , { "『 外來語 』", "３８" }
  , { "　いぃ|イィ(yi)　いぇ|イェ(ye)　", "３９" }
  , { "　うゅ|ウュ(wyu)　", "４０" }
  , { "　うぁ|ウァ(wha)　うぃ|ウィ(whi/wi)　うぅ|ウゥ(whu)　うぇ|ウェ(whe/we)　うぉ|ウォ(who)　", "４１" }
  , { "　ゔぁ|ヴァ(va)　ゔぃ|ヴィ(vi/vyi)　ゔぇ|ヴェ(ve/vye)　ゔぉ|ヴォ(vo)　", "４２" }
  , { "　ゔゃ|ヴャ(vya)　ゔゅ|ヴュ(vyu)　ゔょ|ヴョ(vyo)　", "４３" }
  , { "　ゔぃぇ|ヴィェ(vye)　", "４４" }
  , { "　くぁ|クァ(qwa)　くぃ|クィ qwi (qyi)　くぅ|クゥ(qwu)　くぇ|クェ(qwe/qye)　くぉ|クォ(qwo)　", "４５" }
  , { "　くぁ|クァ|くゎ|クヮ(kwa)　くぃ|クィ(kwi)　くぅ|クゥ(kwu)　くぇ|クェ(kwe)　くぉ|クォ(kwo)　", "４６" }
  , { "　くゃ|クャ(qya)　くゅ|クュ(qyu)　くょ|クョ(qyo)　", "４７" }
  , { "　ぐぁ|グァ|ぐゎ|グヮ(gwa)　ぐぃ|グィ(gwi)　ぐぅ|グゥ(gwu)　ぐぇ|グェ(gwe)　ぐぉ|グォ(gwo)　", "４８" }
  , { "　きぃ|キィ(kyi)　きぇ|キェ(kye)　", "４９" }
  , { "　ぎぃ|ギィ(gyi)　ぎぇ|ギェ(gye)　", "５０" }
  , { "　しぃ|シィ(syi)　しぇ|シェ(sye/she)　", "５１" }
  , { "　じぃ|ジィ(jyi/zyi)　じぇ|ジェ(jye/je/zye)　", "５２" }
  , { "　すぁ|スァ(swa)　すぃ|スィ(swi)　すぅ|スゥ(swu)　すぇ|スェ(swe)　すぉ|スォ(swo)　", "５３" }
  , { "　すゅ|スュ(syu)　", "５４" }
  , { "　ずゅ|ズュ(zyu)　ずぃ|ズィ(zwi)　ずゎ|ズヮ(zwa)　", "５５" }
  , { "　ちぃ|チィ(cyi/tyi)　ちぇ|チェ(che/cye/tye)　", "５６" }
  , { "　ぢぃ|ヂィ(dyi)　ぢぇ|ヂェ(dye)　", "５７" }
  , { "　てゃ|テャ(tha)　てぃ|ティ(thi)　てぇ|テェ(the)　てょ|テョ(tho)　", "５８" }
  , { "　てゅ|テュ(thu/tyu)　", "５９" }
  , { "　でゃ|デャ(dha)　でぃ|ディ(dhi)　でぇ|デェ(dhe)　でょ|デョ(dho)　", "６０" }
  , { "　でゅ|デュ(dhu/dyu)　", "６１" }
  , { "　つぁ|ツァ(tsa)　つぃ|ツィ(tsi)　つぇ|ツェ(tse)　つぉ|ツォ(tso)　", "６２" }
  , { "　つゅ|ツュ(tsyu)　", "６３" }
  , { "　とぁ|トァ(twa)　とぃ|トィ(twi)　とぅ|トゥ(twu)　とぇ|トェ(twe)　とぉ|トォ(two)　", "６４" }
  , { "　どぁ|ドァ(dwa)　どぃ|ドィ(dwi)　どぅ|ドゥ(dwu)　どぇ|ドェ(dwe)　どぉ|ドォ(dwo)　", "６５" }
  , { "　にぃ|ニィ(nyi)　にぇ|ニェ(nye)　", "６６" }
  , { "　ひぃ|ヒィ(hyi)　ひぇ|ヒェ(hye)　", "６７" }
  , { "　びぃ|ビィ(byi)　びぇ|ビェ(bye)　", "６８" }
  , { "　びゎ|ビヮ(bwa)　", "６９" }
  , { "　ぴぃ|ピィ(pyi)　ぴぇ|ピェ(pye)　", "７０" }
  , { "　ふぁ|ファ(fwa/fa)　ふぃ|フィ(fwi/fi/fyi)　ふぅ|フゥ(fwu)　ふぇ|フェ(fwe/fe/fye)　ふぉ|フォ(fwo/fo)　", "７１" }
  , { "　ふゃ|フャ(fya)　ふゅ|フュ(fyu)　ふょ|フョ(fyo)　", "７２" }
  , { "　ふぃぇ|フィェ(fye)　", "７３" }
  , { "　ぷゎ|プヮ(pwa)　", "７４" }
  , { "　ほぅ|ホゥ(hwu)　", "７５" }
  , { "　みぃ|ミィ(myi)　みぇ|ミェ(mye)　", "７６" }
  , { "　りぃ|リィ(ryi/lyi)　りぇ|リェ(rye/lye)　", "７７" }
  -- , { "════════════  ", "７８" }
  }


return kj_table