--[[
各種語言編碼鍵位說明
--]]


local kj_table = {
    { "０", "　『 五十音 』" }
  , { "１", "　　あ|ア(a)　い|イ(i)　う|ウ(u)　え|エ(e)　お|オ(o)　" }
  , { "２", "　　か|カ(ka)　き|キ(ki)　く|ク(ku)　け|ケ(ke)　こ|コ(ko)　" }
  , { "３", "　　さ|サ(sa)　し|シ(shi/si)　す|ス(su)　せ|セ(se)　そ|ソ(so)　" }
  , { "４", "　　た|タ(ta)　ち|チ(chi/ti)　つ|ツ(tsu/tu)　て|テ(te)　と|ト(to)　" }
  , { "５", "　　な|ナ(na)　に|ニ(ni)　ぬ|ヌ(nu)　ね|ネ(ne)　の|ノ(no)　" }
  , { "６", "　　は|ハ(ha)　ひ|ヒ(hi)　ふ|フ(fu/hu)　へ|ヘ(he)　ほ|ホ(ho)　" }
  , { "７", "　　ま|マ(ma)　み|ミ(mi)　む|ム(mu)　め|メ(me)　も|モ(mo)　" }
  , { "８", "　　や|ヤ(ya)　ゆ|ユ(yu)　よ|ヨ(yo)　" }
  , { "９", "　　ら|ラ(ra)　り|リ(ri)　る|ル(ru)　れ|レ(re)　ろ|ロ(ro)　" }
  , { "１０", "　わ|ワ(wa)　を|ヲ(wo)　ん|ン(n)" }
  , { "１１", "　ゐ|ヰ(wi/i/wyi)　ゑ|ヱ(we/e/wye)　" }
  , { "１２", "『 濁音和半濁音 』" }
  , { "１３", "　が|ガ(ga)　ぎ|ギ(gi)　ぐ|グ(gu)　げ|ゲ(ge)　ご|ゴ(go)　" }
  , { "１４", "　ざ|ザ(za)　じ|ジ(ji/zi)　ず|ズ(zu)　ぜ|ゼ(ze)　ぞ|ゾ(zo)　" }
  , { "１５", "　だ|ダ(da)　ぢ|ヂ(di)　づ|ヅ(du)　で|デ(de)　ど|ド(do)　" }
  , { "１６", "　ば|バ(ba)　び|ビ(bi)　ぶ|ブ(bu)　べ|ベ(be)　ぼ|ボ(bo)　" }
  , { "１７", "　ぱ|パ(pa)　ぴ|ピ(pi)　ぷ|プ(pu)　ぺ|ペ(pe)　ぽ|ポ(po)　" }
  , { "１８", "　ヷ(va)　ヸ(vi)　ゔ|ヴ(vu)　ヹ(ve)　ヺ(vo)　" }
  , { "１９", "『 小寫 』" }
  , { "２０", "　ぁ|ァ(xa)　ぃ|ィ(xi)　ぅ|ゥ(xu)　ぇ|ェ(xe)　ぉ|ォ(xo)　" }
  , { "２１", "　っ|ッ(xtu/xtsu)　ゎ|ヮ(xwa)　" }
  , { "２２", "　ゃ|ャ(xya)　ゅ|ュ(xyu)　ょ|ョ(xyo)　" }
  , { "２３", "　ゕ|ヵ(xka/(ヵ=ka))　ゖ|ヶ(xke/(ヶ=ke/ga))　" }
  , { "２４", "『 拗音 』" }
  , { "２５", "　きゃ|キャ(kya)　きゅ|キュ(kyu)　きょ|キョ(kyo)　" }
  , { "２６", "　ぎゃ|ギャ(gya)　ぎゅ|ギュ(gyu)　ぎょ|ギョ(gyo)　" }
  , { "２７", "　しゃ|シャ(sha/sya)　しゅ|シュ(shu/syu)　しょ|ショ(sho/syo)　" }
  , { "２８", "　じゃ|ジャ(ja/jya/zya)　じゅ|ジュ(ju/jyu/zyu)　じょ|ジョ(jo/jyo/zyo)　" }
  , { "２９", "　ぢゃ|ヂャ(dya/ja/zya)　ぢゅ|ヂュ(dyu/ju/zyu)　ぢょ|ヂョ(dyo/jo/zyo)　" }
  , { "３０", "　ちゃ|チャ(cha/tya/cya)　ちゅ|チュ(chu/tyu/cyu)　ちょ|チョ(cho/tyo/cyo)　" }
  , { "３１", "　にゃ|ニャ(nya)　にゅ|ニュ(nyu)　にょ|ニョ(nyo)　" }
  , { "３２", "　ひゃ|ヒャ(hya)　ひゅ|ヒュ(hyu)　ひょ|ヒョ(hyo)　" }
  , { "３３", "　びゃ|ビャ(bya)　びゅ|ビュ(byu)　びょ|ビョ(byo)　" }
  , { "３４", "　ぴゃ|ピャ(pya)　ぴゅ|ピュ(pyu)　ぴょ|ピョ(pyo)　" }
  , { "３５", "　みゃ|ミャ(mya)　みゅ|ミュ(myu)　みょ|ミョ(myo)　" }
  , { "３６", "　りゃ|リャ(rya)　りゅ|リュ(ryu)　リョ|りょ(ryo)　" }
  , { "３７", "════════════  " }
  , { "３８", "『 外來語 』" }
  , { "３９", "　いぃ|イィ(yi)　いぇ|イェ(ye)　" }
  , { "４０", "　うゅ|ウュ(wyu)　" }
  , { "４１", "　うぁ|ウァ(wha)　うぃ|ウィ(whi/wi)　うぅ|ウゥ(whu)　うぇ|ウェ(whe/we)　うぉ|ウォ(who)　" }
  , { "４２", "　ゔぁ|ヴァ(va)　ゔぃ|ヴィ(vi/vyi)　ゔぇ|ヴェ(ve/vye)　ゔぉ|ヴォ(vo)　" }
  , { "４３", "　ゔゃ|ヴャ(vya)　ゔゅ|ヴュ(vyu)　ゔょ|ヴョ(vyo)　" }
  , { "４４", "　ゔぃぇ|ヴィェ(vye)　" }
  , { "４５", "　くぁ|クァ(qwa)　くぃ|クィ qwi (qyi)　くぅ|クゥ(qwu)　くぇ|クェ(qwe/qye)　くぉ|クォ(qwo)　" }
  , { "４６", "　くぁ|クァ|くゎ|クヮ(kwa)　くぃ|クィ(kwi)　くぅ|クゥ(kwu)　くぇ|クェ(kwe)　くぉ|クォ(kwo)　" }
  , { "４７", "　くゃ|クャ(qya)　くゅ|クュ(qyu)　くょ|クョ(qyo)　" }
  , { "４８", "　ぐぁ|グァ|ぐゎ|グヮ(gwa)　ぐぃ|グィ(gwi)　ぐぅ|グゥ(gwu)　ぐぇ|グェ(gwe)　ぐぉ|グォ(gwo)　" }
  , { "４９", "　きぃ|キィ(kyi)　きぇ|キェ(kye)　" }
  , { "５０", "　ぎぃ|ギィ(gyi)　ぎぇ|ギェ(gye)　" }
  , { "５１", "　しぃ|シィ(syi)　しぇ|シェ(sye/she)　" }
  , { "５２", "　じぃ|ジィ(jyi/zyi)　じぇ|ジェ(jye/je/zye)　" }
  , { "５３", "　すぁ|スァ(swa)　すぃ|スィ(swi)　すぅ|スゥ(swu)　すぇ|スェ(swe)　すぉ|スォ(swo)　" }
  , { "５４", "　すゅ|スュ(syu)　" }
  , { "５５", "　ずゅ|ズュ(zyu)　ずぃ|ズィ(zwi)　ずゎ|ズヮ(zwa)　" }
  , { "５６", "　ちぃ|チィ(cyi/tyi)　ちぇ|チェ(che/cye/tye)　" }
  , { "５７", "　ぢぃ|ヂィ(dyi)　ぢぇ|ヂェ(dye)　" }
  , { "５８", "　てゃ|テャ(tha)　てぃ|ティ(thi)　てぇ|テェ(the)　てょ|テョ(tho)　" }
  , { "５９", "　てゅ|テュ(thu/tyu)　" }
  , { "６０", "　でゃ|デャ(dha)　でぃ|ディ(dhi)　でぇ|デェ(dhe)　でょ|デョ(dho)　" }
  , { "６１", "　でゅ|デュ(dhu/dyu)　" }
  , { "６２", "　つぁ|ツァ(tsa)　つぃ|ツィ(tsi)　つぇ|ツェ(tse)　つぉ|ツォ(tso)　" }
  , { "６３", "　つゅ|ツュ(tsyu)　" }
  , { "６４", "　とぁ|トァ(twa)　とぃ|トィ(twi)　とぅ|トゥ(twu)　とぇ|トェ(twe)　とぉ|トォ(two)　" }
  , { "６５", "　どぁ|ドァ(dwa)　どぃ|ドィ(dwi)　どぅ|ドゥ(dwu)　どぇ|ドェ(dwe)　どぉ|ドォ(dwo)　" }
  , { "６６", "　にぃ|ニィ(nyi)　にぇ|ニェ(nye)　" }
  , { "６７", "　ひぃ|ヒィ(hyi)　ひぇ|ヒェ(hye)　" }
  , { "６８", "　びぃ|ビィ(byi)　びぇ|ビェ(bye)　" }
  , { "６９", "　びゎ|ビヮ(bwa)　" }
  , { "７０", "　ぴぃ|ピィ(pyi)　ぴぇ|ピェ(pye)　" }
  , { "７１", "　ふぁ|ファ(fwa/fa)　ふぃ|フィ(fwi/fi/fyi)　ふぅ|フゥ(fwu)　ふぇ|フェ(fwe/fe/fye)　ふぉ|フォ(fwo/fo)　" }
  , { "７２", "　ふゃ|フャ(fya)　ふゅ|フュ(fyu)　ふょ|フョ(fyo)　" }
  , { "７３", "　ふぃぇ|フィェ(fye)　" }
  , { "７４", "　ぷゎ|プヮ(pwa)　" }
  , { "７５", "　ほぅ|ホゥ(hwu)　" }
  , { "７６", "　みぃ|ミィ(myi)　みぇ|ミェ(mye)　" }
  , { "７７", "　りぃ|リィ(ryi/lyi)　りぇ|リェ(rye/lye)　" }
  -- , { "７８", "════════════  " }
  }


return kj_table