--[[
各種語言編碼鍵位說明
--]]


local kp_table = {
    { "₀", "  ※  […] 內為音標字符，(…) 內為編碼" }
  , { "₁", "  ════════════  " }
  , { "₂", "  　  KK   ┊   DJ   ┊   IPA   ┃ 單字示例" }
  , { "₃", "  ════════════  " }
  , { "₄", "  『 單母音/單元音 』" }
  , { "₅", "  　[i] (i) ┊ [iː] (i)(dfkdf/dkd/dfdf/dfhdf) ┊ [iː] ┃ seat" }
  , { "₆", "  　[ɪ] (ii;) ┊ [ɪ] ┊ [ɪ] ┃ sit" }
  , { "₇", "  　[e] (e) ┊ [eɪ] (e)(ii;) ┊ [eɪ] ┃ pain" }
  , { "₈", "  　[ɛ] (ei) ┊ [e] (e) ┊ [e] ┃ head " }
  , { "₉", "  　[æ] (ahe) ┊ [æ] ┊ [æ] ┃ fat" }
  , { "₁₀", "　[ɑ] (ai) ┊ [ɑː] (ai)(dfkdf/dkd/dfdf/dfhdf) ┊ [ɑ] ┃ hot" }
  , { "₁₁", "　[o] (o) ┊ [əʊ] (eq)(wk) ┊ [əʊ] ┃ nose" }
  , { "₁₂", "　[ɔ] (jf/ck) ┊ [ɔː] (jf/ck)(dfkdf/dkd/dfdf/dfhdf) ┊ [ɔː] ┃ four" }
  , { "₁₃", "　[ɔ] (jf/ck) ┊ [ɔ] ┊ [ɒ] (aq) ┃ dog" }
  , { "₁₄", "　[u] (u) ┊ [uː] (u)(dfkdf/dkd/dfdf/dfhdf) ┊ [uː] ┃ too" }
  , { "₁₅", "　[ᴜ] (ui;) ┊ [ʊ] (wk) ┊ [ʊ] ┃ put" }
  , { "₁₆", "　[ʌ] (li/vk) ┊ [ʌ] ┊ [ʌ] ┃ sun" }
  , { "₁₇", "　[ə] (eq) ┊ [ə] ┊ [ə] ┃ again" }
  , { "₁₈", "　[ɪr] (ii;)(r) ┊ [ɪə] (ii;)(eq) ┊ [ɪə] ┃ rear" }
  , { "₁₉", "　[ɚ] (eqk) ┊ [ə] (eq) ┊ [ə˞] (eq)(kw) ┃ brother" }
  , { "₂₀", "　[ɝ] (zk/zr) ┊ [ɜ] (zi) ┊ [ɜ˞] (zi)(kw) ┃ bird " }
  , { "₂₁", "────────────  " }
  , { "₂₂", "『 雙母音/雙元音 』" }
  , { "₂₃", "　[aɪ] (a)(ii;) ┊ [aɪ] ┊ [aɪ] ┃ pie" }
  , { "₂₄", "　[aᴜ] (a)(ui;) ┊ [aʊ] (a)(wk) ┊ [aʊ] ┃ house" }
  , { "₂₅", "　[ɔɪ] (jf/ck)(ii;) ┊ [ɔɪ] ┊ [ɔɪ] ┃ coin" }
  , { "₂₆", "════════════  " }
  , { "₂₇", "『 子音/輔音（清音）』" }
  , { "₂₈", "　[p] (p) ┊ [p] ┊ [p] ┃ pet" }
  , { "₂₉", "　[t] (t) ┊ [t] ┊ [t] ┃ ten" }
  , { "₃₀", "　[k] (k) ┊ [k] ┊ [k] ┃ key " }
  , { "₃₁", "　[f] (f) ┊ [f] ┊ [f] ┃ fat " }
  , { "₃₂", "　[s] (s) ┊ [s] ┊ [s] ┃ sing" }
  , { "₃₃", "　[θ] (qi) ┊ [θ] ┊ [θ] ┃ thank" }
  , { "₃₄", "　[ʃ] (sf) ┊ [ʃ] ┊ [ʃ] ┃ short" }
  , { "₃₅", "　[tʃ] (t)(sf) ┊ [tʃ] ┊ [tʃ] ┃ chair" }
  , { "₃₆", "　[h] (h) ┊ [h] ┊ [h] ┃ ha" }
  , { "₃₇", "────────────  " }
  , { "₃₈", "『 子音/輔音（濁音）』" }
  , { "₃₉", "　[b] (b) ┊ [b] ┊ [b] ┃ book" }
  , { "₄₀", "　[d] (d) ┊ [d] ┊ [d] ┃ desk" }
  , { "₄₁", "　[g] (g) ┊ [g] ┊ [ɡ] (gi) ┃ get" }
  , { "₄₂", "　[v] (v) ┊ [v] ┊ [v] ┃ vest" }
  , { "₄₃", "　[z] (z) ┊ [z] ┊ [z] ┃ zoo" }
  , { "₄₄", "　[ð] (dfx/dx/dt) ┊ [ð] ┊ [ð] ┃ this" }
  , { "₄₅", "　[ʒ] (zf) ┊ [ʒ] ┊ [ʒ] ┃ measure" }
  , { "₄₆", "　[dʒ] (d)(zf) ┊ [dʒ] ┊ [dʒ] ┃ john" }
  , { "₄₇", "　[m] (m) ┊ [m] ┊ [m] ┃ mom" }
  , { "₄₈", "　[n] (n) ┊ [n] ┊ [n] ┃ nose" }
  , { "₄₉", "　[ŋ] (nj) ┊ [ŋ] ┊ [ŋ] ┃ sing" }
  , { "₅₀", "　[l] (l) ┊ [l] ┊ [l] ┃ long" }
  , { "₅₁", "　[r] (r) ┊ [r] ┊ [r] ┃ red" }
  , { "₅₂", "　[j] (j) ┊ [j] ┊ [j] ┃ yes" }
  , { "₅₃", "　[w] (w) ┊ [w] ┊ [w] ┃ we" }
  , { "₅₄", "════════════  " }
  , { "₅₅", "『 重音和次重音 』（補充）" }
  , { "₅₆", "　[ ˋ ] (nw) ┊ [ ˋ ] ┊ [ ˈ ] (pw) ┃ pencil" }
  , { "₅₇", "　[ ˏ ] (dpw/dnw) ┊ [ ˏ ] ┊ [ ˌ ] (dpw/yw/dyw) ┃ education" }
  , { "₅₈", "　※ 奇摩字典 KK 和 DJ 次重音用〔希臘小寫數字標記〕字符：" }
  , { "₅₉", "　　  [ ͵ ] (dpw)。原該用希臘掛接方案輸入：(啟始鍵)(dpw)。" }
  , { "₆₀", "════════════  " }
  , { "https://zh.wikipedia.org/wiki/KK%E9%9F%B3%E6%A8%99", "〔資料來源〕" }
  }


return kp_table