--[[
各種語言編碼鍵位說明
--]]


local ks_table = {
    { "　『 基礎字根 』", "🄁" }
  , { "　　ㅂ(A)　ㅅ(B)　ㄷ(C)　ㅊ(D)　ㅌ(E)　ㅑ(F)　ㅕ(G)　", "🄂" }
  , { "　　ㅐ(H)　ㅣ(I)　ㅓ(J)　ㅏ(K)　ㄴ(L)　ㅛ(M)　ㅗ(N)　", "🄃" }
  , { "　　ㅁ(O)　ㅔ(P)　ㅇ(Q)　ㅠ(R)　ㄹ(S)　ㅜ(T)　ㅈ(U)　", "🄄" }
  , { "　　ㅡ(V)　ㅎ(W)　ㅍ(X)　ㄱ(Y)　ㅋ(Z)　", "🄅" }
  , { "　　ㅃ(AA)　ㅆ(BB)　ㄸ(CC)　ㅒ(HH)　ㅖ(PP)　ㅉ(UU)　ㄲ(YY)　", "🄆" }
  , { "　『 簡速字根 』", "🄇" }
  , { "　　ㅝ(A)　　ㅟ(D)　　ㅘ(E)　　ㄲ(F)　　ㄸ|ㄶ(G)　", "🄈" }
  , { "　　ㅄ(H)　　ㄿ(I)　　ㄺ(J)　　ㅉ|ㄵ(K)　ㅢ(L)　", "🄉" }
  , { "　　ㅆ(M)　　ㄻ(N)　　ㅒ(O)　　ㄽ(P)　　ㅖ(Q)　", "🄊" }
  , { "　ㅃ|ㄼ(R)　ㅙ(S)　　ㄾ(T)　　ㄳ(V)　　ㅀ(W)[對調前碼]　", "１🄁" }
  , { "　ㅚ(X)　　ㅞ(Z)　", "１🄂" }
  -- , { "────────────  ", "１🄃" }
  }


return ks_table