--[[
各種語言編碼鍵位說明
--]]


local ks_table = {
    { "🄁", "　『 基礎字根 』" }
  , { "🄂", "　　ㅂ(A)　ㅅ(B)　ㄷ(C)　ㅊ(D)　ㅌ(E)　ㅑ(F)　ㅕ(G)　" }
  , { "🄃", "　　ㅐ(H)　ㅣ(I)　ㅓ(J)　ㅏ(K)　ㄴ(L)　ㅛ(M)　ㅗ(N)　" }
  , { "🄄", "　　ㅁ(O)　ㅔ(P)　ㅇ(Q)　ㅠ(R)　ㄹ(S)　ㅜ(T)　ㅈ(U)　" }
  , { "🄅", "　　ㅡ(V)　ㅎ(W)　ㅍ(X)　ㄱ(Y)　ㅋ(Z)　" }
  , { "🄆", "　　ㅃ(AA)　ㅆ(BB)　ㄸ(CC)　ㅒ(HH)　ㅖ(PP)　ㅉ(UU)　ㄲ(YY)　" }
  , { "🄇", "　『 簡速字根 』" }
  , { "🄈", "　　ㅝ(A)　　ㅟ(D)　　ㅘ(E)　　ㄲ(F)　　ㄸ|ㄶ(G)　" }
  , { "🄉", "　　ㅄ(H)　　ㄿ(I)　　ㄺ(J)　　ㅉ|ㄵ(K)　ㅢ(L)　" }
  , { "🄊", "　　ㅆ(M)　　ㄻ(N)　　ㅒ(O)　　ㄽ(P)　　ㅖ(Q)　" }
  , { "１🄁", "　ㅃ|ㄼ(R)　ㅙ(S)　　ㄾ(T)　　ㄳ(V)　　ㅀ(W)[對調前碼]　" }
  , { "１🄂", "　ㅚ(X)　　ㅞ(Z)　" }
  -- , { "１🄃", "────────────  " }
  }


return ks_table