--[[
各種語言編碼鍵位說明
--]]


local ky_table = {
    { "⑴", "※  ('')→ 組合附加符號，注音方案改(;;)" }
  , { "⑵", "════════════  " }
  , { "⑶", "『 拼音特殊 』" }
  , { "⑷", "　ā(ae)　á(ap)　ǎ(av)　à(an)　" }
  , { "⑸", "　ē(ee)　é(ep)　ě(ev)　è(en)　" }
  , { "⑹", "　ī(ie/iy)　í(ip)　ǐ(iv)　ì(in)　" }
  , { "⑺", "　ō(oe)　ó(op)　ǒ(ov)　ò(on)　" }
  , { "⑻", "　ū(ue)　ú(up)　ǔ(uv)　ù(un)　" }
  , { "⑼", "　ü(ub)　◌̈(b'')　" }
  , { "⑽", "　ǖ(ueb)　ǘ(upb)　ǚ(uvb)　ǜ(unb)　" }
  , { "⑾", "『 拼音聲調 』" }
  , { "⑿", "　◌̄(e'')　◌́(p'')　◌̌(v'')　◌̀(n'')　" }  --◌
  , { "⒀", "『 注音聲調 』" }
  , { "⒁", "　ˉ(ew)　ˊ(pw)　ˇ(vw)　ˋ(nw)　˙(aw)　" }
  , { "⒂", "『 閩南語特殊 』" }
  , { "⒃", "　â(al)　ê(el)　î(il)　ô(ol)　û(ul)　" }
  , { "⒄", "　a̍(a)(p'')　e̍(e)(p'')　i̍(i)(p'')　o̍(o)(p'')　u̍(u)(p'')　" }
  , { "⒅", "　-(ew)　" }
  , { "⒆", "『 閩南語特殊聲調 』" }
  , { "⒇", "　◌̂(l'')　ˆ(lw)　◌̍(p'')　ˈ(pw)　" }
  }


return ky_table