--[[
各種語言編碼鍵位說明
--]]


local ky_table = {
    { "※  ('')→ 組合附加符號，注音方案改(;;)", "⑴" }
  , { "════════════  ", "⑵" }
  , { "『 拼音特殊 』", "⑶" }
  , { "　ā(ae)　á(ap)　ǎ(av)　à(an)　", "⑷" }
  , { "　ē(ee)　é(ep)　ě(ev)　è(en)　", "⑸" }
  , { "　ī(ie/iy)　í(ip)　ǐ(iv)　ì(in)　", "⑹" }
  , { "　ō(oe)　ó(op)　ǒ(ov)　ò(on)　", "⑺" }
  , { "　ū(ue)　ú(up)　ǔ(uv)　ù(un)　", "⑻" }
  , { "　ü(ub)　◌̈(b'')　", "⑼" }
  , { "　ǖ(ueb)　ǘ(upb)　ǚ(uvb)　ǜ(unb)　", "⑽" }
  , { "『 拼音聲調 』", "⑾" }
  , { "　◌̄(e'')　◌́(p'')　◌̌(v'')　◌̀(n'')　", "⑿" }  --◌
  , { "『 注音聲調 』", "⒀" }
  , { "　ˉ(ew)　ˊ(pw)　ˇ(vw)　ˋ(nw)　˙(aw)　", "⒁" }
  , { "『 閩南語特殊 』", "⒂" }
  , { "　â(al)　ê(el)　î(il)　ô(ol)　û(ul)　", "⒃" }
  , { "　a̍(a)(p'')　e̍(e)(p'')　i̍(i)(p'')　o̍(o)(p'')　u̍(u)(p'')　", "⒄" }
  , { "　-(ew)　", "⒅" }
  , { "『 閩南語特殊聲調 』", "⒆" }
  , { "　◌̂(l'')　ˆ(lw)　◌̍(p'')　ˈ(pw)　", "⒇" }
  }


return ky_table