--[[
各種語言編碼鍵位說明
--]]


local kc_table = {
    { "　『 基礎俄文字母 』", "ⅰ" }
  , { "　　А|а(a)　В|в(b)　С|с(c)　Д|д(d)　Е|е(e)　Ф|ф(f)　", "ⅱ" }
  , { "　　Г|г(g)　Н|н(h)　Ю|ю(i/iho)　Ж|ж(j)　К|к(k)　", "ⅲ" }
  , { "　　Л|л(l/jhi)　М|м(m)　И|и(n)　О|о(o)　Р|р(p)　", "ⅳ" }
  , { "　　Э|э(q)　П|п(r)　Б|б(s)　Т|т(t)　Ч|ч(u)　Ц|ц(v)　", "ⅴ" }
  , { "　　Ш|ш(w)　Х|х(x)　У|у(y)　З|з(z)　", "ⅵ" }
  , { "　　Ь|ь(bf*)　Ы|ы(bi*/bhi)　Ъ|ъ(br)　", "ⅶ" }
  , { "　　Ё|ё(eb)　Й|й(nu)　Я|я(rk)　Щ|щ(wy)　", "ⅷ" }
  , { "　『 早期俄文字母 』", "ⅸ" }
  , { "　　Ѣ|ѣ(bt)　І|і(ii)　Ѵ|ѵ(vr)　Ѳ|ѳ(qi)　", "ⅹ" }
  , { "　　Ѫ|ѫ(vf)　Ѭ|ѭ(ivf/ihvf)　Ѧ|ѧ(af)　Ѩ|ѩ(iaf/ihaf)　", "ⅺ" }
  , { "　『 早期西里爾字母 』", "ⅻ" }
  , { "　Ѕ|ѕ(si)　Ꙁ|ꙁ(zj)　Ѹ|ѹ(ohy)　Ѡ|ѡ(wi)　", "ⅹⅲ" }
  , { "　Ꙑ|ꙑ(bri/brhi)　Ꙗ|ꙗ(iha)　Ѥ|ѥ(iqk/ihc/ihqk)　", "ⅹⅳ" }
  , { "　Ѯ|ѯ(zfy/zfv/zcy/zcv/zyc/zvc)　Ѱ|ѱ(ui)　", "ⅹⅴ" }
  , { "　Ҁ|ҁ(cfy/cy/cfk)　", "ⅹⅵ" }
  , { "　Ї|ї(ib)　Ѻ|ѻ(of)　Ѿ|ѿ(wt)　", "ⅹⅶ" }
  -- , { "────────────  ", "ⅹⅷ" }
  -- , { "", "ⅼ" }
  -- , { "", "ⅽ" }
  -- , { "", "ⅾ" }
  -- , { "", "ⅿ" }
  -- , { "", "ↄ" }
  }


return kc_table