--[[
各種語言編碼鍵位說明
--]]


local kg_table = {
    { "　『 基礎希臘字母 』", "Ⅰ" }
  , { "　　Α|α(a)　Β|β(b)　ς(c*)　Δ|δ(d)　Ε|ε(e)　Φ|φ(f)　", "Ⅱ" }
  , { "　　Γ|γ(g)　Η|η(h)　Ι|ι(i)　Ξ|ξ(j)　Κ|κ(k)　Λ|λ(l)　", "Ⅲ" }
  , { "　　Μ|μ(m)　Ν|ν(n)　Ο|ο(o)　Ρ|ρ(p)　Θ|θ(q)　", "Ⅳ" }
  , { "　　Π|π(r)　Σ|σ(s)　Τ|τ(t)　Ψ|ψ(u)　ν(v*)　Ω|ω(w)　", "Ⅴ" }
  , { "　　Χ|χ(x)　Υ|υ(y)　Ζ|ζ(z)　", "Ⅵ" }
  , { "　『 已停用希臘字母 』", "Ⅶ" }
  , { "　　Ϝ|ϝ(fi)　Ͷ|ͷ(ni)　Ϛ|ϛ(ci)　Ͳ|ͳ(ti)　Ͱ|ͱ(ih)　", "Ⅷ" }
  , { "　　Ϻ|ϻ(mi/mf/myc/my)　Ϙ|ϙ(oy)　Ϟ|ϟ(kf/kw)　", "Ⅸ" }
  , { "　　Ϡ|ϡ(zf)　", "Ⅹ" }
  , { "　『 補充希臘字母 』", "Ⅺ" }
  , { "　　Ϳ|ϳ(ji)　Ϸϸ(lf/bhp/iho/lho)　", "Ⅻ" }
  -- , { "────────────  ", "Ⅻ" }
  -- , { "", "Ⅼ" }
  -- , { "", "Ⅽ" }
  -- , { "", "Ⅾ" }
  -- , { "", "Ⅿ" }
  -- , { "", "Ↄ" }
  }


return kg_table