--[[
各種語言編碼鍵位說明
--]]


local kh_table = {
    { "『 單子音 』", "🄀" }
  , { "　ㄱ(g)　ㄷ(d)     　ㅂ(b)    　ㅅ(s)　ㅇ(x/ng)　", "⒈" }
  , { "　ㅋ(k)　ㅌ(t)      　ㅍ(p/f) 　ㅈ(j) 　ㅎ(h)　", "⒉" }
  , { "　ㄴ(n)　ㄹ(l/r)   　ㅁ(m)   　ㅊ(c)　", "⒊" }
  , { "『 雙子音 』", "⒋" }
  , { "　ㄲ(gg)　ㄸ(dd)　ㅃ(bb)　ㅆ(ss)　ㅉ(jj)　", "⒌" }
  , { "『 單母音 』", "⒍" }
  , { "　ㅣ(i)  　ㅏ(a) 　ㅑ(ya)　", "⒎" }
  , { "　ㅡ(w)　ㅜ(u) 　ㅠ(yu)　", "⒏" }
  , { "　　      　ㅓ(e) 　ㅕ(ye)　", "⒐" }
  , { "　　      　ㅗ(o) 　ㅛ(yo)　", "⒑" }
  , { "『 雙母音 』", "⒒" }
  , { "　ㅐ(ai)　ㅒ(yai)　ㅘ(oa) 　ㅝ(ue)　", "⒓" }
  , { "　ㅔ(ei)　ㅖ(yei)　ㅙ(oai)　ㅞ(uei)　", "⒔" }
  , { "　　    　　          　ㅚ(oi)   　ㅟ(ui)　ㅢ(wi)　", "⒕" }
  , { "────────────  ", "⒖" }
  , { "※  i ↔ y 可互換　", "⒗" }
  , { "────────────  ", "⒘" }
  , { "", "⒙" }
  , { "", "⒚" }
  , { "", "⒛" }
  }


return kh_table