--[[
各種語言編碼鍵位說明
--]]


local kp_table = {
    { "  ※  […] 內為音標字符，(…) 內為編碼", "₀" }
  , { "  ════════════  ", "₁" }
  , { "  　  KK   ┊   DJ   ┊   IPA   ┃ 單字示例", "₂" }
  , { "  ════════════  ", "₃" }
  , { "  『 單母音/單元音 』", "₄" }
  , { "  　[i] (i) ┊ [iː] (i)(dfkdf/dkd/dfdf/dfhdf) ┊ [iː] ┃ seat", "₅" }
  , { "  　[ɪ] (ii;) ┊ [ɪ] ┊ [ɪ] ┃ sit", "₆" }
  , { "  　[e] (e) ┊ [eɪ] (e)(ii;) ┊ [eɪ] ┃ pain", "₇" }
  , { "  　[ɛ] (ei) ┊ [e] (e) ┊ [e] ┃ head ", "₈" }
  , { "  　[æ] (ahe) ┊ [æ] ┊ [æ] ┃ fat", "₉" }
  , { "　[ɑ] (ai) ┊ [ɑː] (ai)(dfkdf/dkd/dfdf/dfhdf) ┊ [ɑ] ┃ hot", "₁₀" }
  , { "　[o] (o) ┊ [əʊ] (eq)(wk) ┊ [əʊ] ┃ nose", "₁₁" }
  , { "　[ɔ] (jf/ck) ┊ [ɔː] (jf/ck)(dfkdf/dkd/dfdf/dfhdf) ┊ [ɔː] ┃ four", "₁₂" }
  , { "　[ɔ] (jf/ck) ┊ [ɔ] ┊ [ɒ] (aq) ┃ dog", "₁₃" }
  , { "　[u] (u) ┊ [uː] (u)(dfkdf/dkd/dfdf/dfhdf) ┊ [uː] ┃ too", "₁₄" }
  , { "　[ᴜ] (ui;) ┊ [ʊ] (wk) ┊ [ʊ] ┃ put", "₁₅" }
  , { "　[ʌ] (li/vk) ┊ [ʌ] ┊ [ʌ] ┃ sun", "₁₆" }
  , { "　[ə] (eq) ┊ [ə] ┊ [ə] ┃ again", "₁₇" }
  , { "　[ɪr] (ii;)(r) ┊ [ɪə] (ii;)(eq) ┊ [ɪə] ┃ rear", "₁₈" }
  , { "　[ɚ] (eqk) ┊ [ə] (eq) ┊ [ə˞] (eq)(kw) ┃ brother", "₁₉" }
  , { "　[ɝ] (zk/zr) ┊ [ɜ] (zi) ┊ [ɜ˞] (zi)(kw) ┃ bird ", "₂₀" }
  , { "────────────  ", "₂₁" }
  , { "『 雙母音/雙元音 』", "₂₂" }
  , { "　[aɪ] (a)(ii;) ┊ [aɪ] ┊ [aɪ] ┃ pie", "₂₃" }
  , { "　[aᴜ] (a)(ui;) ┊ [aʊ] (a)(wk) ┊ [aʊ] ┃ house", "₂₄" }
  , { "　[ɔɪ] (jf/ck)(ii;) ┊ [ɔɪ] ┊ [ɔɪ] ┃ coin", "₂₅" }
  , { "════════════  ", "₂₆" }
  , { "『 子音/輔音（清音）』", "₂₇" }
  , { "　[p] (p) ┊ [p] ┊ [p] ┃ pet", "₂₈" }
  , { "　[t] (t) ┊ [t] ┊ [t] ┃ ten", "₂₉" }
  , { "　[k] (k) ┊ [k] ┊ [k] ┃ key ", "₃₀" }
  , { "　[f] (f) ┊ [f] ┊ [f] ┃ fat ", "₃₁" }
  , { "　[s] (s) ┊ [s] ┊ [s] ┃ sing", "₃₂" }
  , { "　[θ] (qi) ┊ [θ] ┊ [θ] ┃ thank", "₃₃" }
  , { "　[ʃ] (sf) ┊ [ʃ] ┊ [ʃ] ┃ short", "₃₄" }
  , { "　[tʃ] (t)(sf) ┊ [tʃ] ┊ [tʃ] ┃ chair", "₃₅" }
  , { "　[h] (h) ┊ [h] ┊ [h] ┃ ha", "₃₆" }
  , { "────────────  ", "₃₇" }
  , { "『 子音/輔音（濁音）』", "₃₈" }
  , { "　[b] (b) ┊ [b] ┊ [b] ┃ book", "₃₉" }
  , { "　[d] (d) ┊ [d] ┊ [d] ┃ desk", "₄₀" }
  , { "　[g] (g) ┊ [g] ┊ [ɡ] (gi) ┃ get", "₄₁" }
  , { "　[v] (v) ┊ [v] ┊ [v] ┃ vest", "₄₂" }
  , { "　[z] (z) ┊ [z] ┊ [z] ┃ zoo", "₄₃" }
  , { "　[ð] (dfx/dx/dt) ┊ [ð] ┊ [ð] ┃ this", "₄₄" }
  , { "　[ʒ] (zf) ┊ [ʒ] ┊ [ʒ] ┃ measure", "₄₅" }
  , { "　[dʒ] (d)(zf) ┊ [dʒ] ┊ [dʒ] ┃ john", "₄₆" }
  , { "　[m] (m) ┊ [m] ┊ [m] ┃ mom", "₄₇" }
  , { "　[n] (n) ┊ [n] ┊ [n] ┃ nose", "₄₈" }
  , { "　[ŋ] (nj) ┊ [ŋ] ┊ [ŋ] ┃ sing", "₄₉" }
  , { "　[l] (l) ┊ [l] ┊ [l] ┃ long", "₅₀" }
  , { "　[r] (r) ┊ [r] ┊ [r] ┃ red", "₅₁" }
  , { "　[j] (j) ┊ [j] ┊ [j] ┃ yes", "₅₂" }
  , { "　[w] (w) ┊ [w] ┊ [w] ┃ we", "₅₃" }
  , { "════════════  ", "₅₄" }
  , { "『 重音和次重音 』（補充）", "₅₅" }
  , { "　[ ˋ ] (nw) ┊ [ ˋ ] ┊ [ ˈ ] (pw) ┃ pencil", "₅₆" }
  , { "　[ ˏ ] (dpw/dnw) ┊ [ ˏ ] ┊ [ ˌ ] (dpw/yw/dyw) ┃ education", "₅₇" }
  , { "　※ 奇摩字典 KK 和 DJ 次重音用〔希臘小寫數字標記〕字符：", "₅₈" }
  , { "　　  [ ͵ ] ，須用希臘掛接方案，(啟始鍵)+(dpw)輸入。", "₅₉" }
  , { "════════════  ", "₆₀" }
  , { "〔資料來源〕", "https://zh.wikipedia.org/wiki/KK%E9%9F%B3%E6%A8%99" }
  }


return kp_table